app/Models/pruebaModel.php

    public function obtener()
    {
        $query = $this->db->table('Docente');
        $query->select('id_Docente');
        return $query->get()->getResult();
---
SELECT "id_Docente"
FROM "Docente"